d0pplerAKA/Quadcopter-STM32F411/quadcopter-Fly-by-Wire-xboxController-esp32c3/nrf24l01p_config.h
#ifndef __NRF24L01P_CONFIG_H__
#define __NRF24L01P_CONFIG_H__

#include "nrf24l01p.h"
/********** NRF24L01+ config **********/

//NRF Command                                                                     Data bytes
#define NRF_NOP                             0xFF    // No Operation
                                                    //
#define NRF_R_REGISTER                      0x00    // Read Command   
                                                    //                                    LSB 1 ~ 5
#define NRF_W_REGISTER                      0x20    // Write Command  
                                                    //                                    LSB 1 ~ 5
#define NRF_R_RX_PAYLOAD                    0x61    // Read   RX-payload
                                                    //                                    LSB 1 ~ 32
#define NRF_W_TX_PAYLOAD                    0xA0    // Write  TX-payload
                                                    //                                    LSB 1 ~ 32
#define NRF_FLUSH_TX                        0xE1    // Flush TX FIFO
                                                    //
#define NRF_FLUSH_RX                        0xE2    // Flush RX FIFO
                                                    //
#define NRF_REUSE_TX_PL                     0xE3    // Used for a PTX device Reuse last transmitted 
                                                    // payload. TX payload reuse is active until 
                                                    // W_TX_PAYLOAD or FLUSH TX is executed. TX 
                                                    // payload reuse must not be activated or 
                                                    // deactivated during package transmission.
                                                    //
#define NRF_R_RX_PL_WID                     0x60    // Read RX payload width.
                                                    // Note: Flush RX FIFO if the read value is 
                                                    // larger than 32 bytes.
                                                    //
#define NRF_W_ACK_PAYLOAD                   0xA8    // "1010 1PPP"  assume "PPP" -> "000"
                                                    // Write Payload to be transmitted together 
                                                    // with ACK packet on PIPE PPP. (PPP valid in 
                                                    // the range from 000 to 101). Maximum three 
                                                    // ACK packet payloads can be pending. Payloads 
                                                    // with same PPP are handled using first 
                                                    // in - first out principle. Write 
                                                    // payload: 1 – 32 bytes. A write operation 
                                                    // always starts at byte 0.
                                                    //                                    LSB 1 ~ 32
#define NRF_W_TX_PAYLOAD_NOACK              0x80    // Disables AUTOACK on this specific packet.
                                                    //                                    LSB 1 ~ 32
//NRF Register

/*** Form ***/
/*
* 
* 
*
* Bits        Name          Status                                Reset value   details
* Bit [7]:
* Bit [6]:
* Bit [5]:
* Bit [4]:
* Bit [3]:
* Bit [2]:
* Bit [1]:
* Bit [0]:
*/
/*** Form ***/

#define NRF_CONFIG                          0x00
/*
* Config  
* Configuration Register
*
* Bits        Name          Status                                Reset value   details
* Bit 7:      Reserved                                            [0]           Only '0' allowed
* Bit 6:      MASK_RX_DR    [1]: IRQ inactive   [0]: IRQ active   [0]           RX side receive data packet IRQ switch
* Bit 5:      MASK_TX_DS    [1]: IRQ inactive   [0]: IRQ active   [0]           TX side receive Ack packet IRQ switch
* Bit 4:      MASK_MAX_RT   [1]: IRQ inactive   [0]: IRQ active   [0]           Auto Retransimit failed reaches Maximum time IRQ switch
* Bit 3:      EN_CRC        [1]: CRC enable     [0]: CRC disable  [1]           Forced high if one of the bits in the EN_AA is high
* Bit 2:      CRCO          [1]: 2 bytes        [0]: 1 byte       [0]           CRC encoding scheme
* Bit 1:      PWR_UP        [1]: Power up       [0]: power down   [0]           Power control (soft)
* Bit 0:      PRIM_RX       [1]: RX mode        [0]: TX mode      [0]           Mode select
*/

#define NRF_EN_AA                           0x01
/*
* Enhanced ShockBurst™
* Enable ‘Auto Acknowledgment’ Function Disable this functionality to be compatible with nRF2401, see page 75
*
* Bits        Name          Status                                Reset value   details
* Bit [7:6]:  Reserved                                            [00]          Only '00' allowed
* Bit [5]:    ENAA_P5       [1]: Enable         [0]: Disable      [1]           Enable auto acknowledgement data pipe 5
* Bit [4]:    ENAA_P4       [1]: Enable         [0]: Disable      [1]           Enable auto acknowledgement data pipe 4
* Bit [3]:    ENAA_P3       [1]: Enable         [0]: Disable      [1]           Enable auto acknowledgement data pipe 3
* Bit [2]:    ENAA_P2       [1]: Enable         [0]: Disable      [1]           Enable auto acknowledgement data pipe 2
* Bit [1]:    ENAA_P1       [1]: Enable         [0]: Disable      [1]           Enable auto acknowledgement data pipe 1
* Bit [0]:    ENAA_P0       [1]: Enable         [0]: Disable      [1]           Enable auto acknowledgement data pipe 0
*/

#define NRF_EN_RXADDR                       0x02
/*
* EN_RXADDR
* Enabled RX Addresses
*
* Bits        Name          Status                                Reset value   details
* Bit [7:6]:  Reserved                                            [00]          Only '00' allowed
* Bit [5]:    ERX_P5        [1]: Enable         [0]: Disable      [0]           Enable data pipe 5
* Bit [4]:    ERX_P4        [1]: Enable         [0]: Disable      [0]           Enable data pipe 4
* Bit [3]:    ERX_P3        [1]: Enable         [0]: Disable      [0]           Enable data pipe 3
* Bit [2]:    ERX_P2        [1]: Enable         [0]: Disable      [0]           Enable data pipe 2
* Bit [1]:    ERX_P1        [1]: Enable         [0]: Disable      [1]           Enable data pipe 1
* Bit [0]:    ERX_P0        [1]: Enable         [0]: Disable      [1]           Enable data pipe 0
*/

