d0pplerAKA/Quadcopter-STM32F411/quadcopter-Fly-by-Wire-xboxController-esp32c3/nrf24l01p_config.h
#define NRF_SETUP_AW                        0x03
/*
* SETUP_AW
* Setup of Address Widths (common for all data pipes)
*
* Bits        Name          Status                                Reset value   details
* Bit [7:2]:  Reserved                                            [0]           Only 0 allowed
* Bit [1:0]:  AW                                                  [11]          RX/TX Address field width
*                           [00]                                                Illegal
*                           [01]                                                3 bytes
*                           [10]                                                4 bytes
*                           [11]                                                5 bytes
*/

#define NRF_SET_RETR                        0x04
/*
* SETUP_RETR
* Setup of Automatic Retransmission
*
* Bits        Name          Status                                Reset value   details
* Bit [7:4]:  ARD                                                 [0000]        Auto Retransmit Delay 
*                           [0000]                                              Wait 250us
*                           [0001]                                              wait 500us
*                           [0010]                                              wait 750us
*                           [....]                                              ....
*                           [1111]                                              wait 4000us
* Bit [3:0]: ARC                                                  [0011]        Auto Retransmit Count
*                           [0000]                                              Re-transmit disable
*                           [0001]                                              Up to 1 Re-Transmit on fail of AA
*                           [0010]                                              Up to 2 Re-Transmit on fail of AA
*                           [....]                                              ....
*                           [1111]                                              Up to 15 Re-Transmit on fail of AA
*/

#define NRF_RF_CH                           0x05
/*
* RF_CH
* RF Channel
*
* Bits        Name          Status                                Reset value   details
* Bit [7]:    Reserved                                            [0]           Only '0' allowed
* Bit [6:0]:  RF_CH                                               [0000010]     Sets the frequency channel nRF24L01+ operates on
*/

#define NRF_RF_SETUP                        0x06
/*
* RF_SETUP
* RF Setup Register
*
* Bits        Name          Status                                Reset value   details
* Bit [7]:    CONT_WAVE     [1]: Enable         [0]: Disable      [0]           Enables continuous carrier transmit when high.
* Bit [6]:    Reserved                                            [0]           Only '0' allowed
* Bit [5]:    RF_DR_LOW     [1]: Enanle         [0]: Disable      [0]           Set RF Data Rate to 250kbps. See RF_DR_HIGH for encoding.
* Bit [4]:    PLL_LOCK      [1]: Enable         [0]: Disable      [0]           Force PLL lock signal. Only used in test
* Bit [3]:    RF_DR_HIGH    [0]: 1Mbps          [1]: 2Mbps        [1]           [RF_DR_LOW, RF_DR_HIGH]: ‘00’ – 1Mbps/‘01’ – 2Mbps/‘10’ – 250kbps/‘11’ – Reserved
* Bit [2:1]:  RF_PWR                                              [11]          Set RF output power in TX mode
*                           [00]                                                '00' – -18dBm
*                           [01]                                                '01' – -12dBm
*                           [10]                                                '10' –  -6dBm
*                           [11]                                                '11' –   0dBm
* Bit [0]:    Obsolete                                                          Don't care
*/

#define NRF_STATUS                          0x07
/*
* STATUS
* Status Register (In parallel to the SPI command word applied on the MOSI pin, the STATUS register is shifted serially out on the MISO pin)
*
* Bits        Name          Status                                Reset value   details
* Bit [7]:    Reserved                                                          Only '0' allowed
* Bit [6]:    RX_DR         [1]: Clear bit      [0]: No IRQ       [0]           Data Ready RX FIFO interrupt. Asserted when new data arrives RX FIFO
* Bit [5]:    TX_DS         [1]: Clear bit      [0]: No IRQ       [0]           Data Sent TX FIFO interrupt. Asserted when packet transmitted on TX. 
*                                                                               If AUTO_ACK is activated, this bit is set high only when ACK is received.
* Bit [4]:    MAX_RT        [1]: Clear bit      [0]: No IRQ       [0]           Maximum number of TX retransmits interrupt. If MAX_RT is asserted it must 
*                                                                               be cleared to enable further communication.
* Bit [3:1]:  RX_P_NO                                             [111] R       Data pipe number for the payload available for reading from RX_FIFO.
                            [000 ~ 101]                                         Data pipe Number. (0 ~ 5)
* Bit [0]:    TX_FULL       [1]: TX Full        [0]: Available    [0] R         TX FIFO Full flag.
*/

#define NRF_OBSERVE_TX                      0x08
/*
* OBSERVE_TX  
* Transmit observe register
*
* Bits        Name          Status                                Reset value   details
* Bit [7:4]:  PLOS_CNT                                            [0] R         Count lost packets. The counter is overflow protected to 15, 
                                                                                and discontinues at max until reset. The counter is reset by writing to RF_CH.
* Bit [3:0]:  ARC_CNT                                             [0] R         Count retransmitted packets. The counter is reset when transmission of a new packet starts.
*/

#define NRF_RPD                             0x09
/*
* RPD
* 
*
* Bits        Name          Status                                Reset value   details
* Bit [7:1}:  Reserved                                            [000000] R    Only '000000' allowed
* Bit [0]:    RPD                                                 [0] R         Received Power Detector. This register is called CD (Carrier Detect) in the nRF24L01. 
*                                                                               The name is different in nRF24L01+ due to the different input power level threshold 
*                                                                               for this bit. See section 6.4 on page 25.
*/

#define NRF_RX_ADDR_P0                      0x0A
/*
* RX_ADDR_P0
* 
*
* Bits        Name          Status                                Reset value   details
* Bit [39:0]  RX_ADDR_P0                                          0xE7E7E7E7E7  Receive address data pipe 0. 5 Bytes maximum length. 
*                                                                               (LSByte is written first. Write the number of bytes defined by SETUP_AW)
*/

#define NRF_RX_ADDR_P1                      0x0B
/*
* RX_ADDR_P1
* 
*
* Bits        Name          Status                                Reset value   details
* Bit [39:0]  RX_ADDR_P1                                          0xC2C2C2C2C2  Receive address data pipe 1. 5 Bytes maximum length. 
*                                                                               (LSByte is written first. Write the number of bytes defined by SETUP_AW)
*/

#define NRF_RX_ADDR_P2                      0x0C
/*
* RX_ADDR_P2
* 
*
* Bits        Name          Status                                Reset value   details
* Bit [7:0]:  RX_ADDR_P2                                          [0xC3]        Receive address data pipe 2. Only LSB. MSBytes are equal to RX_ADDR_P1[39:8]
*/

#define NRF_RX_ADDR_P3                      0x0D
/*
* RX_ADDR_P3
* 
*
* Bits        Name          Status                                Reset value   details
* Bit [7:0]:  RX_ADDR_P3                                          [0xC4]        Receive address data pipe 3. Only LSB. MSBytes are equal to RX_ADDR_P1[39:8]
*/

#define NRF_RX_ADDR_P4                      0x0E
/*
* RX_ADDR_P4
* 
*
* Bits        Name          Status                                Reset value   details
* Bit [7:0]:  RX_ADDR_P4                                          [0xC5]        Receive address data pipe 4. Only LSB. MSBytes are equal to RX_ADDR_P1[39:8]
*/

#define NRF_RX_ADDR_P5                      0x0F
/*
* RX_ADDR_P5
* 
*
* Bits        Name          Status                                Reset value   details
* Bit [7:0]:  RX_ADDR_P5                                          [0xC6]        Receive address data pipe 5. Only LSB. MSBytes are equal to RX_ADDR_P1[39:8]
*/

#define NRF_TX_ADDR                         0x10
/*
* TX_ADDR
* Transmit address. Used for a PTX device only. (LSByte is written first) 
* Set RX_ADDR_P0 equal to this address to handle automatic acknowledge if this is a PTX device with Enhanced ShockBurst™ enabled. See page 75.
*
* Bits        Name          Status                                Reset value   details
* Bit [39:0]  TX_ADDR                                             0xE7E7E7E7E7  
*/

#define NRF_RX_PW_P0                        0x11
/*
* RX_PW_P0
* Number of bytes in RX payload in data pipe 0 (1 to 32 bytes).
*
* Bits        Name          Status                                Reset value   details
* Bit [7:6]:  Reserved                                            [00]          Only '00' allowed
* Bit [5:0]:  RX_PW_P0                                            [000000]
*                           [000001]                                            1 byte
*                           [000010]                                            2 bytes
*                           [000011]                                            3 bytes
*                           [100000]                                            32 bytes
*/

