d0pplerAKA/Quadcopter-STM32F411/quadcopter-Fly-by-Wire-xboxController-esp32c3/nrf24l01p_config.h
#define NRF_RX_PW_P1                        0x12
/*
* RX_PW_P0
* Number of bytes in RX payload in data pipe 0 (1 to 32 bytes).
*
* Bits        Name          Status                                Reset value   details
* Bit [7:6]:  Reserved                                            [00]          Only '00' allowed
* Bit [5:0]:  RX_PW_P0                                            [000000]
*                           [000001]                                            1 byte
*                           [000010]                                            2 bytes
*                           [000011]                                            3 bytes
*                           [100000]                                            32 bytes
*/

#define NRF_RX_PW_P2                        0x13
/*
* RX_PW_P2
* Number of bytes in RX payload in data pipe 2 (1 to 32 bytes).
*
* Bits        Name          Status                                Reset value   details
* Bit [7:6]:  Reserved                                            [00]          Only '00' allowed
* Bit [5:0]:  RX_PW_P2                                            [000000]
*                           [000001]                                            1 byte
*                           [000010]                                            2 bytes
*                           [000011]                                            3 bytes
*                           [100000]                                            32 bytes
*/

#define NRF_RX_PW_P3                        0x14
/*
* RX_PW_P3
* Number of bytes in RX payload in data pipe 3 (1 to 32 bytes).
*
* Bits        Name          Status                                Reset value   details
* Bit [7:6]:  Reserved                                            [00]          Only '00' allowed
* Bit [5:0]:  RX_PW_P3                                            [000000]
*                           [000001]                                            1 byte
*                           [000010]                                            2 bytes
*                           [000011]                                            3 bytes
*                           [100000]                                            32 bytes
*/

#define NRF_RX_PW_P4                        0x15
/*
* RX_PW_P4
* Number of bytes in RX payload in data pipe 4 (1 to 32 bytes).
*
* Bits        Name          Status                                Reset value   details
* Bit [7:6]:  Reserved                                            [00]          Only '00' allowed
* Bit [5:0]:  RX_PW_P4                                            [000000]
*                           [000001]                                            1 byte
*                           [000010]                                            2 bytes
*                           [000011]                                            3 bytes
*                           [100000]                                            32 bytes
*/

#define NRF_RX_PW_P5                        0x16
/*
* RX_PW_P5
* Number of bytes in RX payload in data pipe 5 (1 to 32 bytes).
*
* Bits        Name          Status                                Reset value   details
* Bit [7:6]:  Reserved                                            [00]          Only '00' allowed
* Bit [5:0]:  RX_PW_P5                                            [000000]
*                           [000001]                                            1 byte
*                           [000010]                                            2 bytes
*                           [000011]                                            3 bytes
*                           [100000]                                            32 bytes
*/

#define NRF_FIFO_STATUS                     0x17
/*
* FIFO_STATUS
* FIFO Status Register
*
* Bits        Name          Status                                Reset value   details
* Bit [7]:    Resvered                                            [0]           Only '0' allowed
* Bit [6]:    T_REUSE       [1]: Reuse         [0]: Reset         [0] R         Used for a PTX device Pulse the rfce high for at least 10µs to Reuse last transmitted payload. 
*                                                                               TX payload reuse is active until W_TX_PAYLOAD or FLUSH TX is executed. 
*                                                                               TX_REUSE is set by the SPI command REUSE_TX_PL, 
*                                                                               and is reset by the SPI commands W_TX_PAYLOAD or FLUSH TX
* Bit [5]:    TX_FULL       [1]: Full          [0]: Available     [0] R         TX FIFO full flag.
* Bit [4]:    TX_EMPTY      [1]: TX Empty      [0]: Data in FIFO  [1] R         TX FIFO empty flag.
* Bit [3:2]:  Reserved                                            [00]          Only '00' allowed
* Bit [1]:    RX_FULL       [1]: Full          [0]: Available     [0] R         RX FIFO full flag.
* Bit [0]:    RX_EMPTY      [1]: RX Empty      [0]: Data in FIFO  [1] R         RX FIFO empty flag.
*/

#define NRF_DYNPD                           0x1C
/*
* DYNPD
* Enable dynamic payload length
*
* Bits        Name          Status                                Reset value   details
* Bit [7:6]:  Reserved                                            [00]          Only '00' allowed
* Bit [5]:    DPL_P5        [1]: Enable        [0]: Disable       [0]           Enable dynamic payload length data pipe 5. (Requires EN_DPL and ENAA_P5)
* Bit [4]:    DPL_P4        [1]: Enable        [0]: Disable       [0]           Enable dynamic payload length data pipe 4. (Requires EN_DPL and ENAA_P4)
* Bit [3]:    DPL_P3        [1]: Enable        [0]: Disable       [0]           Enable dynamic payload length data pipe 3. (Requires EN_DPL and ENAA_P3)
* Bit [2]:    DPL_P2        [1]: Enable        [0]: Disable       [0]           Enable dynamic payload length data pipe 2. (Requires EN_DPL and ENAA_P2)
* Bit [1]:    DPL_P1        [1]: Enable        [0]: Disable       [0]           Enable dynamic payload length data pipe 1. (Requires EN_DPL and ENAA_P1)
* Bit [0]:    DPL_P0        [1]: Enable        [0]: Disable       [0]           Enable dynamic payload length data pipe 0. (Requires EN_DPL and ENAA_P0)
*/

#define NRF_FEATURE                         0x1D
/*
* FEATURE
* Feature Register
*
* Bits        Name          Status                                Reset value   details
* Bit [7:3]:  Reserved                                            [00000]       Only '00000' allowed
* Bit [2]:    EN_DPL        [1]: Enable        [0]: Disable       [0]           Enables Dynamic Payload Length
* Bit [1]:    EN_ACK_PAY    [1]: Enable        [0]: Disable       [0]           Enables Payload with ACK
* Bit [0]:    EN_DYN_ACK    [1]: Enable        [0]: Disable       [0]           Enables the W_TX_PAYLOAD_NOACK command
*/

/**************************************/

/***** Customize Preference *****/

//NRF Enbale
#define NRF_Enable                          ((uint8_t) 0x01)
#define NRF_Disable                         ((uint8_t) 0x00)

//Auto Retransmit Delay
#define NRF_RETRANS_DELAY_250us             ((uint8_t) 0x00)
#define NRF_RETRANS_DELAY_500us             ((uint8_t) 0x10)
#define NRF_RETRANS_DELAY_750us             ((uint8_t) 0x20)
#define NRF_RETRANS_DELAY_1000us            ((uint8_t) 0x30)
#define NRF_RETRANS_DELAY_2000us            ((uint8_t) 0x70)
#define NRF_RETRANS_DELAY_4000us            ((uint8_t) 0xF0)

//Auto Retransmit Count
#define NRF_RETRANS_COUNT_Disable           ((uint8_t) 0x00)
#define NRF_RETRANS_COUNT_Up_to_1           ((uint8_t) 0x01)
#define NRF_RETRANS_COUNT_Up_to_2           ((uint8_t) 0x02)
#define NRF_RETRANS_COUNT_Up_to_3           ((uint8_t) 0x03)
#define NRF_RETRANS_COUNT_Up_to_5           ((uint8_t) 0x05)
#define NRF_RETRANS_COUNT_Up_to_10          ((uint8_t) 0x0A)
#define NRF_RETRANS_COUNT_Up_to_15          ((uint8_t) 0x0F)

//RF Data Rate
#define NRF_RF_RATE_1Mbps                   ((uint8_t) 0x00)
#define NRF_RF_RATE_2Mbps                   ((uint8_t) 0x08)
#define NRF_RF_RATE_250kbps                 ((uint8_t) 0x10)

//RF Output Power
#define NRF_RF_POWER_N18dBm                 ((uint8_t) 0x00)    // (0 0 0 0) low 4
#define NRF_RF_POWER_N12dBm                 ((uint8_t) 0x02)    // (0 0 1 0) low 4
#define NRF_RF_POWER_N6dBm                  ((uint8_t) 0x04)    // (0 1 0 0) low 4
#define NRF_RF_POWER_0dBm                   ((uint8_t) 0x06)    // (0 1 1 0) low 4

//Interrupts
#define NRF_IRQ_RX_FIFO_Ready               ((uint8_t) 0x40)
#define NRF_IRQ_TX_FIFO_Sent                ((uint8_t) 0x20)
#define NRF_IRQ_MAX_Retransmit              ((uint8_t) 0x01)

//Receive Power
#define NRF_Channel_Signal_qualified        ((uint8_t) 0x01)
#define NRF_Channel_Signal_unqualified      ((uint8_t) 0x00)

//Dynamic payload state
#define NRF_Dynamic_payload_Enable          NRF_Enable
#define NRF_Dynamic_payload_Disable         NRF_Disable


/********************************/


#endif
